Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: What is the benefit of on-stack dynamic dispatch?
ru: В чем преимущество динамической диспетчеризации на стеке?

source: What is the benefit of Serde's three-layer design?
ru: В чем преимущество трехслойной конструкции Serde?

source: What is the benefit of the temporary mutability pattern?
ru: В чем преимущество шаблона временной изменяемости?

source: What is the benefit of using a helper function in doc examples?
ru: В чем преимущество использования вспомогательной функции in doc примеров?

source: What is the Builder pattern used for?
ru: Какой шаблон Builder используется for?

source: What is the classic example of RAII guards in std?
ru: Что является классическим примером охранников RAII in std ?

source: What is the Clone to satisfy the borrow checker anti-pattern?
ru: Что такое Clone, чтобы удовлетворить антипаттерн borrow checker?

source: What is the conventional name for a constructor function in Rust?
ru: Как условно называется for функция-конструктор in Rust?

source: What is the crate root?
ru: Что такое корень crate?

source: What is the Dependency Inversion Principle (DIP)?
ru: Что такое принцип инверсии зависимостей (DIP)?

source: What is the downside of using helper functions in doc examples?
ru: В чем недостаток использования вспомогательных функций in doc-примеров?

source: What is the Drop trait for?
ru: Что такое Drop trait for ?

source: What is the DRY principle?
ru: Что такое принцип DRY?

source: What is the expected parameter used for in #[should_panic(expected="...")]?
ru: Какой ожидаемый параметр используется for in #[should_panic(expected="...")]?

source: What is the first principle when passing strings to FFI?
ru: Каков первый принцип при передаче строк в FFI?

source: What is the intended purpose of the Deref trait?
ru: Каково предназначение Deref trait?

source: What is the Interpreter pattern used for?
ru: Какой шаблон интерпретатора используется на сайте for?

source: What is the Iso optic?
ru: Что такое оптика Iso?

source: What is the Law of Demeter (LoD)?
ru: Что такое Закон Деметры (LoD)?

source: What is the Linguistic-Modular-Units principle?
ru: Что такое принцип лингвистически-модульных единиц?

source: What is the Liskov Substitution Principle (LSP)?
ru: Что такое принцип замещения Лискова (LSP)?

source: What is the main advantage of the Strategy pattern?
ru: В чем преимущество шаблона "Стратегия" на сайте main?

source: What is the main consequence of using .clone() to satisfy the borrow checker?
ru: Каково main следствие использования .clone(), чтобы удовлетворить проверку на заимствования?

source: What is the main difference between C strings and Rust strings?
ru: В чем main разница между струнами C и Rust?

source: What is the main goal of Command-Query Separation?
ru: Какова цель main разделения команд и запросов?

source: What is the main goal of Object-Based API design?
ru: Какова цель проектирования объектно-ориентированных API на сайте main?

source: What is the main idea behind the Strategy pattern?
ru: В чем заключается идея main, лежащая в основе паттерна "Стратегия"?

source: What is the main purpose of the Command pattern?
ru: Какова цель шаблона "Команда" на сайте main?

source: What is the main takeaway about Rust's type system from these patterns?
ru: Какой вывод можно сделать из этих паттернов main о системе Rust type?

source: What is the name of the ownership transfer in let s2 = s1;?
ru: Как называется передача прав собственности in let s2 = s1;?

source: What is the never type (!)?
ru: Что такое "никогда" type (!)?

source: What is the newtype pattern?
ru: Что такое шаблон newtype?

source: What is the Newtype pattern?
ru: Что такое шаблон Newtype?

source: What is the orphan rule?
ru: Что такое правило сироты?

source: What is the pattern for cloning only specific values into a move closure?
ru: Какова схема for клонирования только определенных значений в закрытии move?

source: What is the pretty debug syntax?
ru: Каков красивый синтаксис отладки?

source: What is the primary benefit of using &str instead of &String as a function parameter?
ru: В чем главное преимущество использования &amp;str вместо &amp;String as в качестве параметра функции?

source: What is the primary motivation for newtypes?
ru: Какова основная мотивация for новых типов?

source: What is the Principle of Least Astonishment (POLA)?
ru: Что такое принцип наименьшего удивления (POLA)?

source: What is the recommendation about crate size?
ru: Каковы рекомендации по размеру crate?

source: What is the recommended way to combine strings in Rust?
ru: Какой способ рекомендуется для объединения строк in Rust?

source: What is the relationship between String and &str through Deref?
ru: Какова связь между String и &amp;str через Deref?

source: What is the shorthand syntax for struct destructuring?
ru: Что такое сокращенный синтаксис for struct деструктуризации?

source: What is the Sized trait?
ru: Что такое Sized trait?

source: What is the solution to borrow checker issues with large structs?
ru: Каково решение проблем с проверкой заимствований при работе с большими структурами?

source: What is the state pattern?
ru: Что такое государственная модель?

source: What is the Unpin trait?
ru: Что такое Unpin trait?

source: What is true about &String?
ru: Что такое true о &amp;String?

source: What is true about a struct?
ru: Что такое true на сайте struct?

source: What is true about deref-coercion?
ru: Что такое true о дереф-принуждении?

source: What is true about Option?
ru: Что такое true Option?

source: What is true of a relative path?
ru: Что такое true относительного пути?

source: What is true of an absolute path?
ru: Что такое true абсолютного пути?

source: What is Type Consolidation?
ru: Что такое консолидация типов?

source: What is Uniform-Access principle?
ru: Что такое принцип единообразного доступа?

source: What is unsafe Rust?
ru: Что такое unsafe Rust?

source: What is Vec<T> in Rust?
ru: Что такое Vec<T> in Ржавчина?

source: What is work stealing in an async runtime?
ru: Что такое кража работы in на async?

source: What is wrong with using #![deny(warnings)] in crate root?
ru: Что плохого в использовании #![deny(warnings)] in crate root?

source: What is yield_now?
ru: Что такое yield_now?

source: What kinds of crates exist?
ru: Какие виды ящиков существуют?

source: What logic defect is common with Mutex<T>?
ru: Какой логический дефект характерен для Mutex<T>?

source: What makes Ref<T> useful?
ru: Что делает Ref<T> полезным?

source: What must a binary crate contain?
ru: Что должен содержать двоичный файл crate?

source: What must be specified when declaring a field?
ru: Что должно быть указано при объявлении поля?

source: What must you use when pattern matching a #[non_exhaustive] struct?
ru: Что вы должны use при сопоставлении с образцом #[не_исчерпывающий] struct?

source: What primitive is simpler and faster for simple numeric counters in multithreading?
ru: Какой примитив проще и быстрее for простых числовых счетчиков in многопоточности?

source: What principle does the Strategy pattern enable?
ru: По какому принципу работает паттерн "Стратегия"?

source: What problem does Serde's independent data model solve?
ru: Какую проблему решает независимая модель данных Серде?

source: What problem does struct decomposition solve?
ru: Какую проблему решает декомпозиция struct?

source: What problem does the generics as type classes pattern solve?
ru: Какую проблему решает паттерн generics as type classes?

source: What programming paradigm difference is highlighted at the beginning?
ru: Какое различие парадигм программирования подчеркивается в начале?

source: What properties does Rc<RefCell<T>> provide?
ru: Какими свойствами обладает Rc&ltRefCell<T>&gt;?

source: What requirement applies to futures in join_all?
ru: Какое требование относится к фьючерсам in join_all?

source: What Rust feature is mentioned as related to the Interpreter pattern?
ru: Какая особенность Rust упоминается на сайте as в связи с шаблоном Interpreter?

source: What Rust limitation makes implementing Prism directly difficult?
ru: Какое ограничение Rust затрудняет непосредственную реализацию Prism?

source: What should custom error types use for FFI representation?
ru: Что должны представлять пользовательские типы ошибок use for FFI?

source: What should you use if C code can modify string data in FFI?
ru: Что вы должны use if код C может модифицировать строковые данные in FFI?

source: What slice bounds are valid for a string?
ru: Какие границы фрагментов for являются допустимыми для строки?

source: What standard library method demonstrates the Strategy pattern?
ru: Какой стандартный библиотечный метод демонстрирует паттерн Strategy?

source: What standard library method uses the pattern of returning consumed arguments on error?
ru: Какой метод стандартной библиотеки использует шаблон возврата потребленных аргументов при ошибке?

source: What tool can detect unnecessary .clone() calls?
ru: Какой инструмент может обнаружить ненужные вызовы .clone()?

source: What trait is commonly implemented on RAII guards?
ru: Какой сайт trait обычно используется в охранных системах RAII?

source: What trait must a type implement to use mem::take()?
ru: Что trait должен реализовать type, чтобы use запомнить::take()?

source: What trait provides default constructors in Rust?
ru: Что trait предоставляет конструкторы по умолчанию in Rust?

source: What type does the split() method return for String?
ru: Что type делает метод split() return for String ?

source: What type does trpl::race return?
ru: Что type делает trpl::race return?

source: What type should you use for borrowed C strings in Rust?
ru: Какие type вам следует use for позаимствовать строки на языке C in Rust?

source: What unites generics, trait bounds, and lifetimes?
ru: Что объединяет дженерики, границы trait и время жизни?

source: What will borrow_mut() return?
ru: Что заимствует функция borrow_mut() return?

source: What will borrow() on RefCell<T> return?
ru: Что будет делать borrow() on RefCell<T> return?

source: What will collect return from a map iterator?
ru: Что будет собирать return из итератора карты?

source: What will happen? fn plus(x: i32) -> i32 { x + 1 } println!("{}", plus(4));
ru: Что произойдет? fn plus(x: i32) -&gt; i32 { x + 1 } println!("{}", plus(4));

source: What will happen? let mut s = "hi"; s = s.len();
ru: Что произойдет? let mut s = "hi"; s = s.len();

source: What will happen? let mut s = String::from("hello world"); let w = first_word(&s); s.clear(); println!("{w}");
ru: Что произойдет? let mut s = String::from("hello world"); let w = first_word(&amp;s); s.clear(); println!("{w}");

source: What will happen? let number = if false { 10 } else { "ten" };
ru: Что произойдет? let число = if false { 10 } else { "10" };

source: What will happen? let s1 = String::from("hi"); let s2 = s1; println!("{s1}");
ru: Что произойдет? let s1 = String::from("hi"); let s2 = s1; println!("{s1}");

source: What will happen? let x = 5 x = 10;
ru: Что произойдет? let x = 5 x = 10;

source: What will this print? fn main() { let x = { let y = 2; y + 3 }; println!("{x}"); }
ru: Что на нем будет напечатано? fn main() { let x = { let y = 2; y + 3 }; println!("{x}"); }

source: What will this print? let months = ["Jan", "Feb", "Mar"]; println!("{}", months[2]);
ru: Что на нем будет напечатано? let months = ["Jan", "Feb", "Mar"]; println!("{}", months[2]);

source: What will this print? let n = if true { 1 } else { 2 }; println!("{n}");
ru: Что на нем будет напечатано? let n = if true { 1 } else { 2 }; println!("{n}");

source: What will this print? let t = (1, 2.0, 'c'); println!("{}", t.1);
ru: Что на нем будет напечатано? let t = (1, 2.0, 'c'); println!("{}", t.1);

source: What will this print? let x = 5; let x = x + 2; let x = x * 3; println!("{x}");
ru: Что на нем будет напечатано? let x = 5; let x = x + 2; let x = x * 3; println!("{x}");

source: What's needed for debug formatting?
ru: Что нужно for отладки форматирования?

source: What's the advantage of encoding states in types instead of state pattern?
ru: В чем преимущество кодирования состояний in типами вместо шаблона состояний?

source: What's the advantage of if let over match?
ru: В чем преимущество if let перед match?

source: What's the default for pub enum?
ru: Что по умолчанию for pub enum ?

source: What's the default visibility for modules and functions?
ru: Какова стандартная видимость for модулей и функций?

source: What's the difference between _x and _?
ru: В чем разница между _x и _?

source: What's the difference between associated type and generic for trait?
ru: В чем разница между ассоциированным type и общим for trait ?

source: What's the difference between CPU-bound and IO-bound operations?
ru: В чем разница между операциями, привязанными к процессору, и операциями, привязанными к IO?

source: What's the difference between generic with trait bound and trait object?
ru: В чем разница между дженериком с trait и trait объектом?

source: What's the difference between impl Trait and trait bound?
ru: В чем разница между impl Trait и trait bound?

source: What's the difference between unit and integration tests?
ru: В чем разница между модульными и интеграционными тестами?

source: What's the difference between unwrap_or and unwrap_or_else?
ru: В чем разница между unwrap_or и unwrap_or_else?

source: What's the disadvantage of dynamic dispatch?
ru: В чем недостаток динамической диспетчеризации?

source: What's the idiomatic use for HashMap?
ru: Что за идиома use for HashMap?

source: What's the idiomatic way to import a function?
ru: Каков идиоматический способ импорта функции?

source: What's the key difference between "messaging" vs "shared-state"?
ru: В чем ключевая разница между "сообщением" и "общим состоянием"?

source: What's the main advantage of smart pointers in Rust?
ru: В чем main преимущество умных указателей in Rust?

source: What's the point of using iterators and closures in Rust?
ru: В чем смысл использования итераторов и закрытий in Rust?

source: What's true about Box<T> and performance?
ru: Что такое true о Box<T> и производительность?

source: When accepting C strings via FFI, what should you do with foreign strings?
ru: При приеме строк C через FFI, что вы должны делать с иностранными строками по адресу do?

source: When all threads finish
ru: Когда все нити закончатся

source: When an object goes out of scope
ru: Когда объект выходит из области видимости

source: When are threads preferable to async?
ru: Когда нитки предпочтительнее async?

source: When both owner variables go out of scope
ru: Когда обе переменные-владельцы выходят за пределы области видимости

source: When both variables go out of scope
ru: Когда обе переменные выходят за пределы области видимости

source: When changing an enum variant while keeping owned values
ru: При изменении варианта enum while сохраняйте собственные значения

source: When closure is empty
ru: Когда закрытие пустое

source: When comparing enums
ru: При сравнении перечислений

source: When compiler cannot infer the type
ru: Когда компилятор не может определить type

source: When copying enum values
ru: При копировании значений enum

source: When do destructors run in Rust?
ru: Когда do деструкторы выполняют in Rust?

source: When does a reference's lifetime end in simple cases (NLL)?
ru: Когда заканчивается срок службы ссылки in простых случаев (NLL)?

source: When does Rc::get_mut(&mut rc) return Some(&mut T)?
ru: Когда Rc::get_mut(&amp;mut rc) return Some (&amp;mut T)?

source: When does the Deserializer call the Visitor?
ru: Когда десериализатор вызывает посетителя?

source: When does Weak<T> stop being a valid reference?
ru: Когда слабый<T> перестает быть подходящей ссылкой?

source: When is async preferable to threads?
ru: Когда async предпочтительнее ниток?

source: When is Box<dyn Fn> needed for returning closure?
ru: Когда Box&lt;dyn Fn&gt; необходимо for возвращать закрытие?

source: When is glob (*) often used?
ru: Когда часто используется glob (*)?

source: When is it appropriate to call drop(x) manually?
ru: Когда уместно вызывать drop(x) вручную?

source: When is it appropriate to use Box<T>?
ru: В каких случаях уместно использовать use Box<T>?

source: When is mem::take() useful with enums?
ru: Когда mem::take() может быть полезен при работе с перечислениями?

source: When is Mutex lock released?
ru: Когда Mutex замок разблокирован?

source: When is panicking appropriate?
ru: Когда паника уместна?

source: When is the RAII guard's destructor called?
ru: Когда вызывается деструктор охранника RAII?

source: When it goes out of scope
ru: Когда она выходит за рамки

source: When might explicit type annotation be needed in a closure?
ru: in Когда может потребоваться явная аннотация type к закрытию?

source: When might using .clone() be acceptable?
ru: Когда использование .clone() может быть приемлемым?

source: When MutexGuard goes out of scope (Drop)
ru: Когда MutexGuard выходит за рамки (Drop)

source: When need to free resource before end of scope (e.g., mutex)
ru: Когда нужно освободить ресурс до окончания области действия (например, мьютекс)

source: When need to return different closure types from one collection
ru: Когда необходимо получить return различных типов закрытий из одной коллекции

source: When performance is critical
ru: Когда производительность имеет решающее значение

source: When serializing enums
ru: При сериализации перечислений

source: When should you avoid glob (*)?
ru: Когда следует избегать glob (*)?

source: When should you use Box::pin?
ru: Когда следует use Box::pin?

source: When storing an object, store its dependents; when retrieving, retrieve its dependents
ru: При хранении объекта храните его зависимые элементы; при извлечении - извлекайте зависимые элементы

source: When strong_count == 0
ru: Когда strong_count == 0

source: When strong_count == 0 data is freed; upgrade() returns None
ru: Когда strong_count == 0, данные освобождаются; возвращается функция upgrade() None

source: When strong_count == weak_count
ru: Если счетчик strong_count == счетчик weak_count

source: When supporting alternatives, centralize the knowledge in a single module
ru: При поддержке альтернативных вариантов централизуйте знания in в одном модуле

source: When the mutex is locked again
ru: Когда мьютекс снова блокируется

source: When the owner is dropped
ru: Когда владелец падает

source: When there's no pub use
ru: Когда нет pub use

source: When using multithreading
ru: При использовании многопоточности

source: When weak_count == 0
ru: Когда weak_count == 0

source: When will data inside Rc<T> be freed?
ru: Когда данные внутри Rc<T> будут освобождены?

source: When working with std
ru: При работе с std

source: When you need a known-size type for a recursive structure
ru: Когда вам нужна рекурсивная структура известного размера type for

source: When you need a pinned future on the heap
ru: Когда вам нужно закрепить будущее на куче

source: When you need to see explicitly what's imported
ru: Когда вам нужно четко видеть, что импортировано

source: Where are lifetime annotations written in functions?
ru: Где написаны аннотации времени жизни in функций?

source: Where can only irrefutable patterns be used?
ru: Где можно использовать только неопровержимые образцы?

source: Where can patterns be used in Rust?
ru: Где можно использовать узоры in Rust?

source: Where can you use ?
ru: Где вы можете найти use?

source: Where do fixed-size types (e.g., i32) live entirely?
ru: Где живут do типы фиксированного размера (например, i32)?

source: Where does await appear relative to the expression?
ru: Где находится await относительно выражения?

source: Where does Cargo look for the binary crate root?
ru: Где Cargo ищет for корень двоичного файла crate?

source: Where does Cargo look for the library crate root?
ru: Где Cargo ищет for библиотеку crate root?

source: Where is a crate's module structure stored?
ru: Где хранится структура модуля crate?

source: Where is a module file searched?
ru: Где искать файл модуля?

source: Where is code for mod garden; searched?
ru: Где находится код for mod garden; searched?

source: Where is glob most often used?
ru: Где чаще всего используется glob?

source: Where is HashMap located?
ru: Где находится HashMap находится?

source: Where is it more convenient to write complex bounds?
ru: Где удобнее писать сложные границы?

source: Where is the module tree usually written?
ru: Где обычно записывается дерево модулей?

source: where makes the signature more readable
ru: where делает подпись более читабельной

source: Where must procedural macros be located?
ru: Где должны располагаться процедурные макросы?

source: Where the future is created
ru: Где создается будущее

source: Where the program ends
ru: Где заканчивается программа

source: Which approach stores commands as trait objects in the Command pattern?
ru: Какой подход хранит команды as trait объектов in паттерна Command?

source: Which closure can be passed to sort_by_key?
ru: Какое закрытие можно передать sort_by_key?

source: Which code is valid with ? in main?
ru: Какой код действителен при использовании ? in main?

source: Which coercion is allowed?
ru: Какое принуждение допустимо?

source: Which command runs tests in a Rust project?
ru: Какая команда запускает тесты in в проекте Rust?

source: Which fields in struct AveragedCollection are private?
ru: Какие поля in struct AveragedCollection являются частными?

source: Which Fn-trait does any closure implement?
ru: Какой Fn-trait реализует любое закрытие?

source: Which function falls under elision rules?
ru: Какая функция подпадает под правила элизии?

source: Which is preferable in production: unwrap or expect?
ru: Что предпочтительнее in производства: разворачивать или ожидать?

source: Which is the correct borrowed type to prefer over &Box<T>?
ru: Какому заимствованию type следует отдать предпочтение перед &ampBox<T>?

source: Which is the correct borrowed type to prefer over &Vec<T>?
ru: Какому заимствованию type следует отдать предпочтение перед &ampVec<T>?

source: Which is true? fn takes(s: String) {} let x = String::from("hi"); takes(x); // here x ...
ru: Что такое true? fn takes(s: String) {} let x = String::from("hi"); takes(x); // здесь x ...

source: Which keyword defines an asynchronous function?
ru: Какое ключевое слово определяет асинхронную функцию?

source: Which method does the Stream trait define?
ru: Какой метод определяется на сайте Stream trait?

source: Which method must any iterator implement?
ru: Какой метод должен реализовать любой итератор?

source: Which method on the Future trait checks readiness?
ru: Какой метод на сайте Future trait проверяет готовность?

source: Which principle helps with code maintainability by reducing duplication?
ru: Какой принцип помогает в сопровождении кода за счет сокращения дублирования?

source: Which privacy rule is correct?
ru: Какое правило конфиденциальности является верным?

source: Which rule about a value's owner is true?
ru: Какое правило о владельце значения является true?

source: Which signature is more general?
ru: Какая подпись является более общей?

source: Which SOLID principle prevents interface pollution?
ru: Какой принцип SOLID предотвращает загрязнение интерфейса?

source: Which standard library traits represent a Poly Iso?
ru: Какие черты стандартной библиотеки представляют Poly Iso?

source: Which standard library type uses this pattern with to_string()?
ru: В какой стандартной библиотеке type используется этот паттерн с функцией to_string()?

source: Which statement best describes Rust's module system?
ru: Какое утверждение лучше всего описывает систему модулей Rust?
